start                                                                           
                                                                                
XXXXXX> (vera_display_enable 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_tileset 0 16 16 8 32)                                             
(XXXXXXXXX 16 16 8 32 256)                                                      
                                                                                
XXXXXX> (dotimes (ii 16)                                                        
  (dotimes (jj (1+ ii))                                                         
    (vera_tileset_pixel 0 1 jj ii VERA_COLOR_BLUE)))                            
nil                                                                             
                                                                                
XXXXXX> (vera_map 0 32 32 VERA_MAP_TYPE_TILE)                                   
(XXXXXXXXX 32 32 2)                                                             
                                                                                
XXXXXX> (vera_layer_map 0 0)                                                    
0                                                                               
                                                                                
XXXXXX> (vera_layer_tileset 0 0)                                                
0                                                                               
                                                                                
XXXXXX> (defvar row1 10)                                                        
row1                                                                            
                                                                                
XXXXXX> (defvar col1 20)                                                        
col1                                                                            
                                                                                
XXXXXX> (defvar row2 20)                                                        
row2                                                                            
                                                                                
XXXXXX> (defvar col2 10)                                                        
col2                                                                            
                                                                                
XXXXXX> (defvar row3 16)                                                        
row3                                                                            
                                                                                
XXXXXX> (defvar col3 16)                                                        
col3                                                                            
                                                                                
XXXXXX> (vera_map_entry 0 col1 row1 1)                                          
1                                                                               
                                                                                
XXXXXX> (vera_map_entry 0 col2 row2 (logior VERA_MAPENTRY_HFLIP_MASK VERA_MAPENT
RY_VFLIP_MASK 1))                                                               
3073                                                                            
                                                                                
XXXXXX> (vera_map_entry 0 col3 row3 (logior (ash 1 VERA_MAPENTRY_PAL_OFFSET_SHIF
T) 1))                                                                          
4097                                                                            
                                                                                
XXXXXX> (vera_layer_enable 0 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_irqline 0)                                                        
0                                                                               
                                                                                
XXXXXX> (vera_line_capture_enable 1)                                            
1                                                                               
                                                                                
XXXXXX> (loop (if (= (vera_line_capture_enable) 0) (return)))                   
nil                                                                             
                                                                                
XXXXXX> (dolist (rowcol (list (cons row1 col1) (cons row2 col2) (cons row3 col3)
))                                                                              
  (vera_irqline (* 16 (car rowcol)))                                            
  (vera_line_capture_enable 1)                                                  
  (loop (if (= (vera_line_capture_enable) 0) (return)))                         
  (dotimes (ii 16)                                                              
    (print (vera_line_capture_read_pixel (+ (* 16 (cdr rowcol)) ii)))))         
                                                                                
(0 0 10)                                                                        
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(0 0 10)                                                                        
(6 6 6)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
(0 0 0)                                                                         
nil                                                                             
                                                                                
XXXXXX> 'end                                                                    
end                                                                             
