start                                                                           
                                                                                
XXXXXX> (vera_display_enable 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_sprite_enable 1)                                                  
1                                                                               
                                                                                
XXXXXX> (defvar w 64)                                                           
w                                                                               
                                                                                
XXXXXX> (defvar h 64)                                                           
h                                                                               
                                                                                
XXXXXX> (defvar bpp 8)                                                          
bpp                                                                             
                                                                                
XXXXXX> (vera_tileset 0 w h bpp 8)                                              
(XXXXXXXXX 64 64 8 8 4096)                                                      
                                                                                
XXXXXX> (vera_tileset 0)                                                        
(XXXXXXXXX 64 64 8 8 4096)                                                      
                                                                                
XXXXXX> (vera_sprite_init 1)                                                    
nil                                                                             
                                                                                
XXXXXX> (vera_sprite_tile 1 0 2)                                                
(0 2)                                                                           
                                                                                
XXXXXX> (vera_sprite_z_depth 1 VERA_SPRITE_Z_L1)                                
3                                                                               
                                                                                
XXXXXX> (vera_sprite_init 2)                                                    
nil                                                                             
                                                                                
XXXXXX> (vera_sprite_tile 2 0 2)                                                
(0 2)                                                                           
                                                                                
XXXXXX> (vera_sprite_z_depth 2 VERA_SPRITE_Z_L1)                                
3                                                                               
                                                                                
XXXXXX> (dotimes (yy h)                                                         
  (dotimes (xx (min w (1+ yy)))                                                 
    (vera_sprite_pixel 1 xx yy VERA_COLOR_CYAN)))                               
nil                                                                             
                                                                                
XXXXXX>                                                                         
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
(vera_sprite_x 1 40)                                                            
40                                                                              
                                                                                
XXXXXX> (vera_sprite_y 1 50)                                                    
50                                                                              
                                                                                
XXXXXX> (vera_sprite_x 2 200)                                                   
200                                                                             
                                                                                
XXXXXX> (vera_sprite_y 2 200)                                                   
200                                                                             
                                                                                
XXXXXX> (vera_sprite_col_mask 1 1)                                              
1                                                                               
                                                                                
XXXXXX> (vera_sprite_col_mask 2 1)                                              
1                                                                               
                                                                                
XXXXXX> (vera_sprite_col_mask 1)                                                
1                                                                               
                                                                                
XXXXXX> (vera_sprite_col_mask 2)                                                
1                                                                               
                                                                                
XXXXXX> (vera_ien VERA_IRQ_SPRCOL 1)                                            
4                                                                               
                                                                                
XXXXXX>                                                                         
                                                                                
                                                                                
                                                                                
(vera_isr)                                                                      
0                                                                               
                                                                                
XXXXXX>                                                                         
(vera_sprite_x 2 40)                                                            
40                                                                              
                                                                                
XXXXXX> (vera_sprite_y 2 50)                                                    
50                                                                              
                                                                                
XXXXXX>                                                                         
                                                                                
                                                                                
                                                                                
(vera_isr)                                                                      
4                                                                               
                                                                                
XXXXXX> 'end                                                                    
end                                                                             
