start                                                                           
                                                                                
XXXXXX> (vera_init)                                                             
nil                                                                             
                                                                                
XXXXXX> (vera_tileset 0 320 1 1 1)                                              
(XXXXXXXXX 320 1 1 1 40)                                                        
                                                                                
XXXXXX> (vera_tileset 0 320 1 1 1)                                              
Error: 'vera_tileset' already initialized: 0                                    
XXXXXX> (vera_tileset_deinit 0)                                                 
nil                                                                             
                                                                                
XXXXXX> (vera_tileset_deinit 0)                                                 
Error: 'vera_tileset_deinit' not initialized: 0                                 
XXXXXX> (vera_tileset 0 320)                                                    
Error: 'vera_tileset' too few arguments                                         
XXXXXX> (vera_tileset 0 320 1)                                                  
Error: 'vera_tileset' too few arguments                                         
XXXXXX> (vera_tileset 0 320 1 1)                                                
Error: 'vera_tileset' too few arguments                                         
XXXXXX> (vera_tileset 0 320 1 1 0 1)                                            
Error: 'vera_tileset' too many arguments                                        
XXXXXX> (vera_tileset 0 321 1 1 1)                                              
Error: 'vera_tileset' invalid argument: 321                                     
XXXXXX> (vera_tileset 0 320 0 1 1)                                              
Error: 'vera_tileset' invalid argument: 0                                       
XXXXXX> (vera_tileset 0 320 1 10 1)                                             
Error: 'vera_tileset' invalid argument: 10                                      
XXXXXX> (vera_tileset 1 320 240 8 1)                                            
(XXXXXXXXX 320 240 8 1 76800)                                                   
                                                                                
XXXXXX> (vera_tileset 2 320 240 8 1)                                            
Error: 'vera_tileset' insufficient resources                                    
XXXXXX> 'end                                                                    
end                                                                             
