start                                                                           
                                                                                
XXXXXX> (vera_tileset 0 320 64 1 1)                                             
(XXXXXXXXX 320 64 1 1 2560)                                                     
                                                                                
XXXXXX> (vera_tileset_pixel 0 0 320 0 101)                                      
Error: 'vera_tileset_pixel' invalid argument: 320                               
XXXXXX> (vera_tileset_pixel 0 0 0 64 101)                                       
Error: 'vera_tileset_pixel' invalid argument: 64                                
XXXXXX> (vera_tileset_deinit 0)                                                 
nil                                                                             
                                                                                
XXXXXX> (vera_tileset 0 640 32 1 1)                                             
(XXXXXXXXX 640 32 1 1 2560)                                                     
                                                                                
XXXXXX> (vera_tileset_pixel 0 0 640 0 101)                                      
Error: 'vera_tileset_pixel' invalid argument: 640                               
XXXXXX> (vera_tileset_pixel 0 0 0 32 101)                                       
Error: 'vera_tileset_pixel' invalid argument: 32                                
XXXXXX> 'end                                                                    
end                                                                             
