start                                                                           
                                                                                
XXXXXX> (vera_display_enable 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_sprite_enable 1)                                                  
1                                                                               
                                                                                
XXXXXX> (defvar w 8)                                                            
w                                                                               
                                                                                
XXXXXX> (defvar h 8)                                                            
h                                                                               
                                                                                
XXXXXX> (defvar bpp 8)                                                          
bpp                                                                             
                                                                                
XXXXXX> (vera_tileset 0 w h bpp 8)                                              
(XXXXXXXXX 8 8 8 8 64)                                                          
                                                                                
XXXXXX> (vera_tileset 0)                                                        
(XXXXXXXXX 8 8 8 8 64)                                                          
                                                                                
XXXXXX> (vera_sprite_init 1)                                                    
nil                                                                             
                                                                                
XXXXXX> (vera_sprite_init 65)                                                   
nil                                                                             
                                                                                
XXXXXX> (vera_sprite_tile 1 0 1)                                                
(0 1)                                                                           
                                                                                
XXXXXX> (vera_sprite_tile 65 0 1)                                               
(0 1)                                                                           
                                                                                
XXXXXX> (vera_sprite_pal_offset 65 1)                                           
1                                                                               
                                                                                
XXXXXX> (vera_sprite_z_depth 1 VERA_SPRITE_Z_L1)                                
3                                                                               
                                                                                
XXXXXX> (vera_sprite_z_depth 65 VERA_SPRITE_Z_L1)                               
3                                                                               
                                                                                
XXXXXX> (vera_tileset_pixel 0 1 0 0 VERA_COLOR_CYAN)                            
3                                                                               
                                                                                
XXXXXX> (vera_sprite_x 1 40)                                                    
40                                                                              
                                                                                
XXXXXX> (vera_sprite_y 1 50)                                                    
50                                                                              
                                                                                
XXXXXX> (vera_sprite_x 65 100)                                                  
100                                                                             
                                                                                
XXXXXX> (vera_sprite_y 65 200)                                                  
200                                                                             
                                                                                
XXXXXX> (vera_irqline 50)                                                       
50                                                                              
                                                                                
XXXXXX> (vera_sprite_bank 0)                                                    
0                                                                               
                                                                                
XXXXXX> (vera_sprite_bank)                                                      
0                                                                               
                                                                                
XXXXXX> (vera_line_capture_enable 1)                                            
1                                                                               
                                                                                
XXXXXX> (loop (if (= (vera_line_capture_enable) 0) (return)))                   
nil                                                                             
                                                                                
XXXXXX> (print (vera_line_capture_read_pixel 40))                               
                                                                                
(10 15 14)                                                                      
(10 15 14)                                                                      
                                                                                
XXXXXX> (vera_irqline 200)                                                      
200                                                                             
                                                                                
XXXXXX> (vera_line_capture_enable 1)                                            
1                                                                               
                                                                                
XXXXXX> (loop (if (= (vera_line_capture_enable) 0) (return)))                   
nil                                                                             
                                                                                
XXXXXX> (print (vera_line_capture_read_pixel 100))                              
                                                                                
(0 0 0)                                                                         
(0 0 0)                                                                         
                                                                                
XXXXXX> (vera_irqline 50)                                                       
50                                                                              
                                                                                
XXXXXX> (vera_sprite_bank 1)                                                    
1                                                                               
                                                                                
XXXXXX> (vera_sprite_bank)                                                      
1                                                                               
                                                                                
XXXXXX> (vera_line_capture_enable 1)                                            
1                                                                               
                                                                                
XXXXXX> (loop (if (= (vera_line_capture_enable) 0) (return)))                   
nil                                                                             
                                                                                
XXXXXX> (print (vera_line_capture_read_pixel 40))                               
                                                                                
(0 0 0)                                                                         
(0 0 0)                                                                         
                                                                                
XXXXXX> (vera_irqline 200)                                                      
200                                                                             
                                                                                
XXXXXX> (vera_line_capture_enable 1)                                            
1                                                                               
                                                                                
XXXXXX> (loop (if (= (vera_line_capture_enable) 0) (return)))                   
nil                                                                             
                                                                                
XXXXXX> (print (vera_line_capture_read_pixel 100))                              
                                                                                
(3 3 3)                                                                         
(3 3 3)                                                                         
                                                                                
XXXXXX> 'end                                                                    
end                                                                             
