start                                                                           
                                                                                
XXXXXX> (vera_display_enable 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_sprite_enable 1)                                                  
1                                                                               
                                                                                
XXXXXX> (defvar w 64)                                                           
w                                                                               
                                                                                
XXXXXX> (defvar h 64)                                                           
h                                                                               
                                                                                
XXXXXX> (defvar bpp 8)                                                          
bpp                                                                             
                                                                                
XXXXXX> (vera_tileset 0 w h bpp 8)                                              
(XXXXXXXXX 64 64 8 8 4096)                                                      
                                                                                
XXXXXX> (vera_tileset 0)                                                        
(XXXXXXXXX 64 64 8 8 4096)                                                      
                                                                                
XXXXXX> (vera_sprite_init 200)                                                  
Error: 'vera_sprite_init' invalid argument: 200                                 
XXXXXX> (vera_sprite_init 1)                                                    
nil                                                                             
                                                                                
XXXXXX> (vera_sprite_tile 200 0 2)                                              
Error: 'vera_sprite_tile' invalid argument: 200                                 
XXXXXX> (vera_sprite_tile 1 400 2)                                              
Error: 'vera_sprite_tile' invalid argument: 400                                 
XXXXXX> (vera_sprite_tile 1 40 2)                                               
Error: 'vera_sprite_tile' invalid argument: 40                                  
XXXXXX> (vera_sprite_tile 1 0 200)                                              
Error: 'vera_sprite_tile' index out of range: 200                               
XXXXXX> (vera_sprite_tile 1 0 2)                                                
(0 2)                                                                           
                                                                                
XXXXXX> (vera_sprite_z_depth 200 0)                                             
Error: 'vera_sprite_z_depth' invalid argument: 200                              
XXXXXX> (vera_sprite_z_depth 1 20)                                              
Error: 'vera_sprite_z_depth' invalid argument: 20                               
XXXXXX> (vera_sprite_z_depth 1 VERA_SPRITE_Z_BG_L0)                             
1                                                                               
                                                                                
XXXXXX> (vera_sprite_pal_offset 1000 1)                                         
Error: 'vera_sprite_pal_offset' invalid argument: 1000                          
XXXXXX> (vera_sprite_pal_offset 1 1000)                                         
Error: 'vera_sprite_pal_offset' invalid argument: 1000                          
XXXXXX> (vera_sprite_pal_offset 1 1)                                            
1                                                                               
                                                                                
XXXXXX> (vera_sprite_hflip 1000 1)                                              
Error: 'vera_sprite_hflip' invalid argument: 1000                               
XXXXXX> (vera_sprite_hflip 1 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_sprite_vflip 1000 1)                                              
Error: 'vera_sprite_vflip' invalid argument: 1000                               
XXXXXX> (vera_sprite_vflip 1 1)                                                 
1                                                                               
                                                                                
XXXXXX> (vera_sprite_col_mask 1000 1)                                           
Error: 'vera_sprite_col_mask' invalid argument: 1000                            
XXXXXX> (vera_sprite_col_mask 1 1)                                              
1                                                                               
                                                                                
XXXXXX>                                                                         
'end                                                                            
end                                                                             
