start

XXXXXX> (defvar cols 32)
cols

XXXXXX> (defvar rows 32)
rows

XXXXXX> (vera :map 0 :init :width cols :height rows :map_type VERA_MAP_TYPE_TXT1
6)
(:addr XXXXXXXXX :width 32 :height 32 :map_type 0)

XXXXXX> (vera :map 0 :entry :x cols :y 0      (                                (
                (logio) 1))h VERA_COLOR_BLUE 12) (ash VERA_COLOR_WHITE 8)
Error: 'vera_map_entry' invalid argument: 32
XXXXXX> (vera :map 0 :entry :x 0 :y rows    (                                  (
                (logior) 1)) VERA_COLOR_PURPLE 12) (ash VERA_COLOR_YELLOW 8)
Error: 'vera_map_entry' invalid argument: 32
XXXXXX> (vera :map 0 :deinit)
nil

XXXXXX>
(setq cols 64)
64

XXXXXX> (setq rows 64)
64

XXXXXX> (vera :map 0 :init :width cols :height rows :map_type VERA_MAP_TYPE_TXT1
6)
(:addr XXXXXXXXX :width 64 :height 64 :map_type 0)

XXXXXX> (vera :map 0 :entry :x cols :y 0      (                                (
                (logio) 1))h VERA_COLOR_BLUE 12) (ash VERA_COLOR_WHITE 8)
Error: 'vera_map_entry' invalid argument: 64
XXXXXX> (vera :map 0 :entry :x 0 :y rows    (                                  (
                (logior) 1)) VERA_COLOR_PURPLE 12) (ash VERA_COLOR_YELLOW 8)
Error: 'vera_map_entry' invalid argument: 64
XXXXXX> (vera :map 0 :deinit)
nil

XXXXXX>
(setq cols 128)
128

XXXXXX> (setq rows 128)
128

XXXXXX> (vera :map 0 :init :width cols :height rows :map_type VERA_MAP_TYPE_TXT1
6)
(:addr XXXXXXXXX :width 128 :height 128 :map_type 0)

XXXXXX> (vera :map 0 :entry :x cols :y 0      (                                (
                (logio) 1))h VERA_COLOR_BLUE 12) (ash VERA_COLOR_WHITE 8)
Error: 'vera_map_entry' invalid argument: 128
XXXXXX> (vera :map 0 :entry :x 0 :y rows    (                                  (
                (logior) 1)) VERA_COLOR_PURPLE 12) (ash VERA_COLOR_YELLOW 8)
Error: 'vera_map_entry' invalid argument: 128
XXXXXX> (vera :map 0 :deinit)
nil

XXXXXX>
(setq cols 256)
256

XXXXXX> (setq rows 256)
256

XXXXXX> (vera :map 0 :init :width cols :height rows :map_type VERA_MAP_TYPE_TXT1
6)
(:addr XXXXXXXXX :width 256 :height 256 :map_type 0)

XXXXXX> (vera :map 0 :entry :x cols :y 0      (                                (
                (logio) 1))h VERA_COLOR_BLUE 12) (ash VERA_COLOR_WHITE 8)
Error: 'vera_map_entry' invalid argument: 256
XXXXXX> (vera :map 0 :entry :x 0 :y rows    (                                  (
                (logior) 1)) VERA_COLOR_PURPLE 12) (ash VERA_COLOR_YELLOW 8)
Error: 'vera_map_entry' invalid argument: 256
XXXXXX> (vera :map 0 :deinit)
nil

XXXXXX>
'end
end
