start                                                                           
                                                                                
XXXXXX> (vera_init)                                                             
nil                                                                             
                                                                                
XXXXXX> (vera_tileset 0 8 8 1 1)                                                
(XXXXXXXXX 8 8 1 1 8)                                                           
                                                                                
XXXXXX> (vera_tileset 0 8 8 1 1)                                                
Error: 'vera_tileset' already initialized: 0                                    
XXXXXX> (vera_tileset_deinit 0)                                                 
nil                                                                             
                                                                                
XXXXXX> (vera_tileset_deinit 0)                                                 
Error: 'vera_tileset_deinit' not initialized: 0                                 
XXXXXX> (vera_tileset 1 8)                                                      
Error: 'vera_tileset' too few arguments                                         
XXXXXX> (vera_tileset 1 8 8)                                                    
Error: 'vera_tileset' too few arguments                                         
XXXXXX> (vera_tileset 1 8 8 1)                                                  
Error: 'vera_tileset' too few arguments                                         
XXXXXX> (vera_tileset 1 8 8 1 1 0)                                              
Error: 'vera_tileset' too many arguments                                        
XXXXXX> (vera_tileset 100 8 8 1 1)                                              
Error: 'vera_tileset' invalid argument: 100                                     
XXXXXX> (vera_tileset 2 9 8 1 1)                                                
Error: 'vera_tileset' invalid argument: 9                                       
XXXXXX> (vera_tileset 2 8 9 1 1)                                                
Error: 'vera_tileset' invalid argument: 9                                       
XXXXXX> (vera_tileset 2 8 8 10 1)                                               
Error: 'vera_tileset' invalid argument: 10                                      
XXXXXX> (vera_tileset 2 8 8 1 0)                                                
Error: 'vera_tileset' invalid argument: 0                                       
XXXXXX> (vera_tileset 2 8 8 1 1025)                                             
Error: 'vera_tileset' invalid argument: 1025                                    
XXXXXX> (vera_tileset 3 64 64 8 32)                                             
(XXXXXXXXX 64 64 8 32 4096)                                                     
                                                                                
XXXXXX> (vera_tileset 4 64 64 8 2)                                              
Error: 'vera_tileset' insufficient resources                                    
XXXXXX> 'end                                                                    
end                                                                             
